
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторОбъекта = Строка(Запись.ИдентификаторОбъекта); 
	ИмяОбъектаМетаданных = Запись.ОбъектМетаданных.НаименованиеПолное;    
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяОбъектаМетаданных);
	СсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(Запись.ИдентификаторОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбъекта(Команда) 
	
	Если Лев(ИмяОбъектаМетаданных, 8) = "Документ" Тогда
		ОткрытьФорму(ИмяОбъектаМетаданных + ".Форма.ФормаДокумента", Новый Структура("Ключ", СсылкаНаОбъект));
	Иначе
		ОткрытьФорму(ИмяОбъектаМетаданных + ".Форма.ФормаЭлемента", Новый Структура("Ключ", СсылкаНаОбъект));
	КонецЕсли;
	
КонецПроцедуры

