#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПояснениеКДопОбработчикам.Заголовок =
	"Для инициации доп. обработчиков, в теле запроса к сервису необходимо передать структуру ""ДопОбработчики[ВидОбрабочика]""
	|В дополнительных обработчиках используются следующие переменные: 
	|- ""ОбрабатываемыйОбъект"" - обрабатываемый элемент объекта метаданных;
	|- ""ВидОбработчика"" - строка - значения: ""ПередЗаписью"" или ""ПриЗаписи"";
	|- ""ПараметрыОбъекта"" - структура - ""техническая"" информация по объекту из справочника ""um_ОбъектыМетаданных"";
	|- ""РеквизитыЗапроса"" - структура - реквизиты, переданные в теле запроса к сервису";
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура СформироватьПредставление(Команда)
	СформироватьПредставлениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура СформироватьПредставлениеНаСервере()  
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъекта) Тогда
		Объект.ПредставлениеВСервисе = "";	
		Возврат;
	КонецЕсли;   
	
	ПараметрыПреобразованияJSON = Новый Структура("ПрочитатьВСоответствие", Истина);  
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыПреобразованияJSON", ПараметрыПреобразованияJSON);
		
	ПараметрыЗапроса = Новый Структура("sl, dl, text", "ru", "en", Объект.ИмяОбъекта);
		
	Попытка	
		Ответ = КоннекторHTTP.GetJson("https://ftapi.pythonanywhere.com/translate", ПараметрыЗапроса, ДополнительныеПараметры);  
		Объект.ПредставлениеВСервисе = СтрЗаменить((ТРег(Ответ.Получить("destination-text"))), " ", "");
	Исключение
		Объект.ПредставлениеВСервисе = СтроковыеФункции.СтрокаЛатиницей(Объект.ИмяОбъекта);	
	КонецПопытки;	
	
КонецПроцедуры  

#КонецОбласти