
&НаСервере
Процедура ПриОткрытииНаСервере()
	ОбновитьПинкоды();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ОбновитьПинкоды()
Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Пинкод.Ссылка КАК Пинкод,
	|	Пинкод.ВерсияДанных КАК ВерсияДанных,
	|	Пинкод.ПометкаУдаления КАК ПометкаУдаления,
	|	Пинкод.Код КАК Код,
	|	Пинкод.Наименование КАК Наименование,
	|	Пинкод.СтатусПинкода КАК СтатусПинкода,
	|	Пинкод.КомплектПоставки КАК КомплектПоставки,
	|	Пинкод.Предопределенный КАК Предопределенный,
	|	Пинкод.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.Пинкод КАК Пинкод
	|ГДЕ
	|	Пинкод.КомплектПоставки = &КомплектПоставки";
	Запрос.УстановитьПараметр("КомплектПоставки", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();        
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Объект.Пинкоды.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Пинкоды.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПинкодыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ОбновитьПинкоды();
КонецПроцедуры
