     Функция ЗначениеДополнительнойКонстанты(ИмяКонстанты, ВозвращатьКакМассив = Ложь, ВызыватьИсключение = Истина) Экспорт
	
	ЗначениеДополнительнойКонстанты = Новый Массив;
	
	СправочникСсылка = Справочники.ДополнительныеКонстанты.НайтиПоНаименованию(ИмяКонстанты, Истина);
	
	Если НЕ СправочникСсылка.Пустая() Тогда
		
		ЗначениеДополнительнойКонстанты = Новый Массив;
		
		Для Каждого СтрокаЗначений Из СправочникСсылка.Значения Цикл
			
			Если НЕ СтрокаЗначений.ЗначениеВХранилищеЗначений Тогда
				
				ЗначениеДополнительнойКонстанты.Добавить(СтрокаЗначений.Значение);
				
			Иначе
				
				ЗначениеДополнительнойКонстанты.Добавить(СтрокаЗначений.ЗначениеХранилище.Получить());
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеДополнительнойКонстанты.Количество() = 1 И НЕ ВозвращатьКакМассив Тогда
			
			ЗначениеДополнительнойКонстанты = ЗначениеДополнительнойКонстанты[0];
			
		КонецЕсли;
		
	ИначеЕсли ВызыватьИсключение Тогда
		
		ВызватьИсключение "Не найдена доп. константа: """ + ИмяКонстанты + """";
		
	КонецЕсли;
	
	Возврат ЗначениеДополнительнойКонстанты;
	
КонецФункции
