
&НаСервереБезКонтекста
Процедура ОбработататьСтрокуОчередиНаСервере(ИдентификаторыОбработчика)
	
	ОбработкаДанных.ОбработатьОчередь(ИдентификаторыОбработчика);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработататьСтрокуОчереди(Команда) 
	
	ТекДанные = Элементы.Список.ТекущиеДанные; 
	Если ТекДанные.Обработано Тогда
		ПоказатьПредупреждение(,НСтр("ru='Повторно обработать можно только запись с ошибкой.'"),5);
		Возврат;
	КонецЕсли;     
	
	ОбработататьСтрокуОчередиНаСервере(Новый Структура("Идентификатор, ВремяИнициации, ИнформационнаяБаза", 
										ТекДанные.Идентификатор, ТекДанные.ВремяИнициации, ТекДанные.ИнформационнаяБаза));  

	Элементы.Список.Обновить();
	
КонецПроцедуры
