
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеФайла = ПолучитьФайлИзХранилища(ВыбраннаяСтрока);  
	
	ИмяФайла = ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес);    
	ДвоичныеДанныеФайла.Записать(ИмяФайла);
	
	ЗапуститьПриложение(ИмяФайла);
	
	    
КонецПроцедуры               

Функция ПолучитьФайлИзХранилища(Ссылка)
	
	Результат = Новый Структура;
	Результат.Вставить("Адрес", ПоместитьВоВременноеХранилище(Ссылка.ФайлХранилище.Получить()));   
	Результат.Вставить("Расширение", Ссылка.Расширение);
	
	Возврат Результат
	
КонецФункции
