#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.Параметры.Отбор.Свойство("Обмен", Владелец);
	Элементы.ДобавитьВсеБазы.Видимость = ЗначениеЗаполнено(Владелец);
	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиКомандФормы 
 
&НаСервере
Процедура ДобавитьВсеПродБазыНаСервере()   
	
	РегистрыСведений.НастройкиИБИОбменов.ДополнитьСписокПродуктивнымиБазами(Владелец);
    			
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсеПродБазы(Команда)
	
	ДобавитьВсеПродБазыНаСервере(); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти


