#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)  
	          
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофилиГруппДоступаИнформационныхБаз.Ссылка КАК Ссылка,
		|	ПрофилиГруппДоступаИнформационныхБаз.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ПрофилиГруппДоступаИнформационныхБаз КАК ПрофилиГруппДоступаИнформационныхБаз
		|ГДЕ
		|	ПрофилиГруппДоступаИнформационныхБаз.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ДобавитьГруппуДоступаИБ();
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл   
		Если Не Выборка.ПометкаУдаления = ПометкаУдаления Тогда
			СинхронизироватьПометкуУдаления(Выборка.Ссылка);	
		КонецЕсли;
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьГруппуДоступаИБ() 
	
	ГруппаДоступа = Справочники.ПрофилиГруппДоступаИнформационныхБаз.СоздатьЭлемент();
	ГруппаДоступа.Владелец = Ссылка;
	ГруппаДоступа.Записать();
	
КонецПроцедуры 

Процедура СинхронизироватьПометкуУдаления(ГруппаДоступаСсылка)
	
	ГруппаДоступа = ГруппаДоступаСсылка.ПолучитьОбъект();
	ГруппаДоступа.УстановитьПометкуУдаления(ПометкаУдаления);
	
КонецПроцедуры

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли